clc ;clear;


a1 = 0.1 ; b1 =0.2 ;
a2 = 0.14; b2= 0.22;

A=[ a1 b1  0  0 ;
   -b1 a1  0  0 ;
    0  0  a2  b2;
    0  0 -b2  a2];

P=[0   1   1   1;
   1   0   1   1;
   1   1   0   1; 
   1   1   1   0];

B=P*A*P^-1;

C =   [-0.0267   -0.5394   -0.6854   -0.4884;
       -0.6133    0.5720   -0.0392   -0.5433;
        0.7827    0.3645    0.0409   -0.5028;
       -0.1024   -0.4989    0.7260   -0.4621]*0.9
eig(C)

a11=C(1,1); a12=C(1,2); a13=C(1,3); a14=C(1,4);
a21=C(2,1); a22=C(2,2); a23=C(2,3); a24=C(2,4);
a31=C(3,1); a32=C(3,2); a33=C(3,3); a34=C(3,4);
a41=C(4,1); a42=C(4,2); a43=C(4,3); a44=C(4,4);

x1=[];x2=[];x3=[];x4=[];
x1(1)=0.1;x2(1)=0.1;x3(1)=0.1;x4(1)=0.1;

epsilon1 =2.2*10^10;   epsilon2 =2.4*10^10;   epsilon3 =2.6*10^10;
sigma1   =7*10^8;      sigma2  =7*10^8;     sigma3  =7*10^8;

% epsilon1 =3*10^8;      epsilon2 = 6*10^8;   epsilon3 =1.2*10^9;
% sigma1   =2*10^5;      sigma2    =4*10^5;   sigma3   =8*10^5;


p1=[];p2=[];
%每迭代一次生成8bits，NIST测试需要产生10^8Bits
%因此需要迭代12500000次
M=12500000;
for k=1:M
    p1(k)=mod(floor((x1(k)*x2(k))/2^16+x3(k)/10^7),2^8);
    x1(k+1)=a11*x1(k)+a12*x2(k)+a13*x3(k)+a14*x4(k);
    x2(k+1)=a21*epsilon1*cos(sigma1*p1(k))+a22*x2(k)+a23*x3(k)+a24*x4(k);
    x3(k+1)=a31*epsilon2*cos(sigma2*p1(k))+a32*x2(k)+a33*x3(k)+a34*x4(k);
    x4(k+1)=a41*epsilon3*cos(sigma3*p1(k))+a42*x2(k)+a43*x3(k)+a44*x4(k);
end

% 将产生的二进制随机数写入txt文档，用于NIST测试
p2=dec2bin(p1);
fid = fopen('NIST.txt','wt');
fprintf(fid,'%c',p2);
fclose(fid);